import { ScrollView, Text, View,Image } from "react-native";

import defaultStyles from './styles';

function AboutUs() {

  const styles = defaultStyles();

  return (
    <>
        <ScrollView contentContainerStyle={styles.root}>
        <Text style={styles.title}>
        Кафедра «Програмне забезпечення автоматизованих систем»
        </Text>
        <Image
          source={require('../../assets/img/photo_caf.jpg')}
        />
        <View style={styles.texts}>
          <Text>
          Кафедра «Програмного забезпечення автоматизованих систем» створена у 1998 році в результаті реорганізації кафедри
           «Обчислювальної техніки» та організації факультету ФІТІС, якому вона належить. Кафедра є випусковою зі 
           спеціальності 121– «Інженерія програмногозабезпечення».
          </Text>
          <Text>
          Інженерія програмного забезпечення – це дисципліна, яка пов’язана зі всіма аспектами виробництва програмного забезпечення 
          від початкових стадій створення специфікації до підтримки системи після здачі в експлуатацію.
          </Text>
          <Text>
          Освіта в сфері інженерії програмного забезпечення – це розумна інвестиція у своє майбутнє. У нас Ви навчитеся не просто
           програмувати (кодувати), а створювати програмні продукти – аналізувати вимоги, працювати в командні розробників,
            тестувати та забезпечувати якість продукту, керувати програмними проектами.
          </Text>
          <Text>
          На нашій кафедрі працюють керівники та спеціалісти ІТ компаній, що з радістю діляться знаннями та досвідом зі студентами.
           Студенти кафедри проходять виробничі практики в ІТ компаніях з 1-го до 5-го курсів, що надає їм переваги у практичному 
           досвіді та спрощує подальше працевлаштування.
          </Text>
          <Text>
          Навчальний процес ведуть 11 науково-педагогічних працівників: 2 професори, 5 кандидатів наук, доцентів, старші викладачі 
          та асистенти.Забезпечує навчальний процес учбово-допоміжний персонал кафедри у складі 2 осіб. Кафедра налічує
           13 співробітників. За час існуваннякафедри її співробітниками захищені 1 докторська та 9 кандидатських дисертацій.
           </Text>
        </View>
      
      </ScrollView>
    </>
  )
}

export default AboutUs;